app/controllers/subjects_controller.rb

SELECT "subjects".* FROM "subjects"
---
  def index
    @subjects = Subject.all

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @subject = Subject.find(params[:id])

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @subject = Subject.find(params[:id])

INSERT INTO "subjects" ("name", "content", "teacher", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "で"], ["content", "頭"], ["teacher", "だｄさ"], ["created_at", "2020-10-09 03:37:05.326875"], ["updated_at", "2020-10-09 03:37:05.326875"]]
---
  def create
    @subject = Subject.new(subject_params)
    if @subject.save

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "subjects" SET "teacher" = ?, "updated_at" = ? WHERE "subjects"."id" = ?  [["teacher", "井上くん"], ["updated_at", "2020-10-09 03:20:07.467767"], ["id", 1]]
---
  def update
    @subject = Subject.find(params[:id])
    @subject.assign_attributes(subject_params)
    if @subject.save

SELECT  "subjects".* FROM "subjects" WHERE "subjects"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
DELETE FROM "subjects" WHERE "subjects"."id" = ?  [["id", 8]]
---
  def destroy
    @subject = Subject.find(params[:id])
    @subject.destroy